---
kind: type
id: T:Autodesk.Revit.DB.LineSegment
source: html/d67cd999-109a-9465-39d0-99bba3e775cf.htm
---
# Autodesk.Revit.DB.LineSegment

An output node that represents a tessellated line segment.

## Syntax (C#)
```csharp
public class LineSegment : IDisposable
```

## Remarks
See also: OnLineSegment(LineSegment) .